Add refernces and diagrams in README.md
